xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_ll_bus.h
/** @defgroup BUS_LL_EC_IOP_GRP1_PERIPH  IOP GRP1 PERIPH
  * @{
  */
#define LL_IOP_GRP1_PERIPH_ALL             0xFFFFFFFFU
#define LL_IOP_GRP1_PERIPH_GPIOA           RCC_IOPENR_GPIOAEN
#define LL_IOP_GRP1_PERIPH_GPIOB           RCC_IOPENR_GPIOBEN
#define LL_IOP_GRP1_PERIPH_GPIOC           RCC_IOPENR_GPIOCEN
#define LL_IOP_GRP1_PERIPH_GPIOD           RCC_IOPENR_GPIODEN
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHB1 AHB1
  * @{
  */

/**
  * @brief  Enable AHB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHBENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHBENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHBENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHBENR, Periphs);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL  
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHBRSTR, Periphs);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL  
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1 
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHBRSTR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1_GRP1 APB1 GRP1
  * @{
  */

/**
  * @brief  Enable APB1 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWM    
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG   
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1   
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPA    
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DBGMCU 
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC    
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1 
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APBENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APBENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 GRP1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWM    
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG   
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1   
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPA    
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DBGMCU 
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC    
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1 
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APBENR1, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWM    
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG   
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1   
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPA    
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DBGMCU 
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC    
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1 
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBENR1, Periphs);
}

/**
  * @brief  Force APB1 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL    
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWM    
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG   
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1   
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPA    
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DBGMCU 
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC    
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1 
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APBRSTR1, Periphs);
}

/**
  * @brief  Release APB1 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL    
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWM    
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG   
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1   
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2   
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPA    
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DBGMCU 
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR    
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC    
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2 
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1 
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBRSTR1, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1_GRP2 APB1 GRP2
  * @{
  */

/**
  * @brief  Enable APB1 GRP2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17  
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP1  
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP2  
  *         @arg @ref LL_APB1_GRP2_PERIPH_LCD    
  *         @arg @ref LL_APB1_GRP2_PERIPH_TK     
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APBENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APBENR2, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 GRP2 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17  
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP1  
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP2  
  *         @arg @ref LL_APB1_GRP2_PERIPH_LCD    
  *         @arg @ref LL_APB1_GRP2_PERIPH_TK     
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APBENR2, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 GRP2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17  
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP1  
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP2  
  *         @arg @ref LL_APB1_GRP2_PERIPH_LCD    
  *         @arg @ref LL_APB1_GRP2_PERIPH_TK     
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBENR2, Periphs);
}

/**
  * @brief  Force APB1 GRP2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL    
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17  
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP1  
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP2  
  *         @arg @ref LL_APB1_GRP2_PERIPH_LCD    
  *         @arg @ref LL_APB1_GRP2_PERIPH_TK     
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APBRSTR2, Periphs);
}

/**
  * @brief  Release APB1 GRP2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL    
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1 
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16  
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM17  
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC1   
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP1  
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP2  
  *         @arg @ref LL_APB1_GRP2_PERIPH_LCD    
  *         @arg @ref LL_APB1_GRP2_PERIPH_TK     
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @note (*) peripheral not available on all devices
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBRSTR2, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_IOP IOP
  * @{
  */

/**
  * @brief  Enable IOP peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD
  * @retval None
  */
__STATIC_INLINE void LL_IOP_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->IOPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->IOPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if IOP peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_IOP_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->IOPENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable IOP peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD
  * @retval None
  */
__STATIC_INLINE void LL_IOP_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->IOPENR, Periphs);
}

/**
  * @brief  Disable IOP peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_ALL
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD
  * @retval None
  */
__STATIC_INLINE void LL_IOP_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->IOPRSTR, Periphs);
}

/**
  * @brief  Release IOP peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_ALL
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD
  * @retval None
  */
__STATIC_INLINE void LL_IOP_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->IOPRSTR, Periphs);
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* RCC */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32L090_LL_BUS_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
